[
  {
    "id": 1,
    "title": "Advanced MERN Stack Development",
    "category": "Web Technology",
    "type": "Offline",
    "image": "../../src/assets/img/Mern-card.jpg",
    "fee": "28000৳",
    "rating": 4.9,
    "totalRating": 128,
    "totalStudentsEnroll": 350,
    "instructorName": "Michael Chen",
    "instructorImg": "instructor_michael",
    "instructorEmail": "michael@codeacademy.com",
    "technology": "MongoDB, Express.js, React, Node.js, Redux, JWT",
    "courseStart": "12-March-2025",
    "duration": 16,
    "totalExam": 6,
    "totalProject": 5,
    "details": "This comprehensive MERN stack course provides in-depth training on building modern web applications. Over 16 weeks, you'll master MongoDB for database management, Express.js for backend API development, React for building interactive user interfaces, and Node.js for server-side JavaScript. The curriculum includes Redux for state management, JWT for authentication, and deployment strategies. You'll complete five real-world projects including a full-featured e-commerce platform and social media application. Each module includes hands-on coding exercises, code reviews, and best practice discussions. The course culminates with a capstone project where you'll design and deploy your own MERN stack application from scratch, incorporating all the technologies learned throughout the program."
  },
  {
    "id": 2,
    "title": "Advanced Graphic Design with AI",
    "category": "Art & Graphic",
    "type": "Offline",
    "image": "../../src/assets/img/GD-Card (1).jpg",
    "fee": "25000৳",
    "rating": 4.8,
    "totalRating": 95,
    "totalStudentsEnroll": 280,
    "instructorName": "Emma Wilson",
    "instructorImg": "instructor_emma",
    "instructorEmail": "emma@designschool.edu",
    "technology": "Photoshop, Illustrator, Midjourney, DALL-E, CorelDRAW",
    "courseStart": "15-March-2025",
    "duration": 12,
    "totalExam": 4,
    "totalProject": 7,
    "details": "This cutting-edge graphic design course combines traditional design principles with the latest AI tools to create stunning visual content. Over 12 weeks, you'll become proficient in Adobe Creative Suite (Photoshop, Illustrator) while integrating AI tools like Midjourney and DALL-E into your workflow. The curriculum covers branding, digital illustrations, typography, and automated design processes. You'll complete seven projects including logo design, marketing collateral, and digital artwork collections. Special modules focus on AI-assisted design workflows, where you'll learn to generate and refine concepts using artificial intelligence. The course includes weekly design challenges, portfolio reviews, and a final exhibition project where you'll create a complete brand identity package for a fictional company, showcasing your mastery of both traditional and AI-enhanced design techniques."
  },
  {
    "id": 3,
    "title": "UI/UX Design Specialization",
    "category": "Design",
    "type": "Hybrid",
    "image": "../../src/assets/img/GD-Card (1).jpg",
    "fee": "22000৳",
    "rating": 4.8,
    "totalRating": 145,
    "totalStudentsEnroll": 420,
    "instructorName": "David Kim",
    "instructorImg": "instructor_david",
    "instructorEmail": "david@designmaster.edu",
    "technology": "Figma, Adobe XD, Sketch, UserTesting, Protopie",
    "courseStart": "18-March-2025",
    "duration": 14,
    "totalExam": 5,
    "totalProject": 6,
    "details": "This intensive UI/UX design course provides a complete foundation in user-centered design principles and practices. Over 14 weeks, you'll master the entire design process from user research and personas to wireframing, prototyping, and usability testing. Using industry-standard tools like Figma and Adobe XD, you'll create six comprehensive projects including mobile apps, web platforms, and interactive prototypes. The curriculum covers information architecture, interaction design, visual hierarchy, and accessibility standards. You'll conduct real user research, analyze findings, and iterate designs based on feedback. The course includes a capstone project where you'll solve a complex UX problem from start to finish, resulting in a professional-quality case study for your portfolio. Graduates will be equipped with both the technical skills and design thinking methodology needed for UX/UI roles."
  },
  {
    "id": 4,
    "title": "PHP & Laravel Web Development",
    "category": "Web Technology",
    "type": "Online",
    "image": "php_img",
    "fee": "20000৳",
    "rating": 4.6,
    "totalRating": 87,
    "totalStudentsEnroll": 310,
    "instructorName": "Ryan Park",
    "instructorImg": "instructor_ryan",
    "instructorEmail": "ryan@webdev.com",
    "technology": "PHP, Laravel, MySQL, Blade, Eloquent, REST API",
    "courseStart": "20-March-2025",
    "duration": 10,
    "totalExam": 6,
    "totalProject": 4,
    "details": "This comprehensive PHP and Laravel course takes you from fundamental programming concepts to building robust web applications with the Laravel framework. Over 10 weeks, you'll master PHP syntax and object-oriented programming before diving into Laravel's powerful features including Eloquent ORM, Blade templating, and authentication systems. The curriculum covers database design with MySQL, RESTful API development, and deployment strategies. You'll build four progressively complex projects culminating in a full-featured e-commerce platform with payment gateway integration. Each module includes practical coding exercises, debugging techniques, and security best practices. The course emphasizes modern development workflows with version control and team collaboration. By the end, you'll be able to architect and develop secure, scalable web applications using PHP and Laravel, ready for professional deployment."
  },
  {
    "id": 5,
    "title": "Digital Illustration Masterclass",
    "category": "Art & Graphic",
    "type": "Online",
    "image": "illustration_img",
    "fee": "18000৳",
    "rating": 4.7,
    "totalRating": 112,
    "totalStudentsEnroll": 380,
    "instructorName": "Sophia Rodriguez",
    "instructorImg": "instructor_sophia",
    "instructorEmail": "sophia@artacademy.edu",
    "technology": "Procreate, Photoshop, Illustrator, Wacom Tablets",
    "courseStart": "22-March-2025",
    "duration": 12,
    "totalExam": 3,
    "totalProject": 8,
    "details": "This professional digital illustration course provides comprehensive training in creating stunning artwork using modern digital tools. Over 12 weeks, you'll master Procreate and Photoshop while developing your unique artistic style. The curriculum covers fundamental drawing techniques, color theory, composition, and advanced brush customization. You'll complete eight diverse projects including character design, environment painting, and editorial illustration. Special modules focus on workflow optimization, client communication, and preparing artwork for different media (print, web, animation). Each week includes live demonstration, critique sessions, and technical workshops. The course culminates with a personal illustration project where you'll create a series of cohesive artworks suitable for professional portfolios. Whether you're a beginner looking to establish fundamentals or an experienced artist wanting to refine your digital skills, this course provides the structured training and professional feedback to elevate your illustration work."
  },
  {
    "id": 6,
    "title": "Web Design with WordPress",
    "category": "Web Technology",
    "type": "Offline",
    "image": "wordpress_img",
    "fee": "15000৳",
    "rating": 4.5,
    "totalRating": 76,
    "totalStudentsEnroll": 290,
    "instructorName": "David Miller",
    "instructorImg": "instructor_david_m",
    "instructorEmail": "david@wpdev.com",
    "technology": "WordPress, Elementor, WooCommerce, PHP, CSS",
    "courseStart": "25-March-2025",
    "duration": 8,
    "totalExam": 4,
    "totalProject": 5,
    "details": "This practical WordPress course teaches you to build professional websites without extensive coding knowledge while also covering essential customization techniques. Over 8 weeks, you'll master WordPress fundamentals including theme selection, plugin management, and content organization. The curriculum progresses to advanced topics like custom theme development, WooCommerce setup, and performance optimization. You'll complete five real-world projects including business websites, blogs, and e-commerce stores. Hands-on exercises cover page builders like Elementor, security best practices, and SEO optimization. The course includes a module on client management and website maintenance. For the final project, you'll design, build, and launch a complete WordPress website for a simulated client, incorporating all aspects of the design and development process. Graduates will be equipped to create professional websites for themselves or clients using the world's most popular CMS."
  },
  {
    "id": 7,
    "title": "Motion Graphics with After Effects",
    "category": "Design",
    "type": "Online",
    "image": "motion_graphics_img",
    "fee": "22000৳",
    "rating": 4.7,
    "totalRating": 103,
    "totalStudentsEnroll": 340,
    "instructorName": "Jessica Kim",
    "instructorImg": "instructor_jessica",
    "instructorEmail": "jessica@motiondesign.com",
    "technology": "After Effects, Premiere Pro, Cinema 4D, Illustrator",
    "courseStart": "28-March-2025",
    "duration": 10,
    "totalExam": 4,
    "totalProject": 6,
    "details": "This professional motion graphics course provides comprehensive training in Adobe After Effects and related tools for creating stunning animations and visual effects. Over 10 weeks, you'll master the complete motion design workflow from concept to final render. The curriculum covers keyframe animation, typography animation, 3D layers, camera tracking, and advanced compositing techniques. You'll complete six projects including title sequences, explainer videos, and promotional animations. Special modules focus on integrating Cinema 4D for 3D elements and using expressions for efficient animation. Each week includes technical demonstrations, creative challenges, and project critiques. The course culminates with a professional reel showcasing your best work. Whether you're creating content for social media, broadcast, or digital platforms, this course provides the technical skills and artistic foundation to produce high-quality motion graphics that captivate audiences."
  },
  {
    "id": 8,
    "title": "JavaScript Frameworks Comparison",
    "category": "Web Technology",
    "type": "Online",
    "image": "js_frameworks_img",
    "fee": "18000৳",
    "rating": 4.6,
    "totalRating": 89,
    "totalStudentsEnroll": 320,
    "instructorName": "Thomas Lee",
    "instructorImg": "instructor_thomas",
    "instructorEmail": "thomas@jsmasters.com",
    "technology": "React, Angular, Vue.js, TypeScript, Next.js",
    "courseStart": "01-April-2025",
    "duration": 8,
    "totalExam": 5,
    "totalProject": 4,
    "details": "This intensive JavaScript frameworks course provides a comprehensive comparison of React, Angular, and Vue.js, helping you choose the right tool for each project. Over 8 weeks, you'll build the same application with each framework to understand their strengths and weaknesses. The curriculum covers component architecture, state management, routing, and performance optimization in each ecosystem. You'll complete four projects including a single-page application, dashboard interface, and e-commerce frontend. Special modules focus on TypeScript integration and server-side rendering with Next.js and Nuxt.js. The course includes framework selection guidelines, migration strategies, and interview preparation. By the end, you'll be able to evaluate project requirements and select the most appropriate JavaScript framework while being comfortable working with all three. This knowledge makes you valuable in diverse development environments and prepares you for framework-agnostic positions."
  },
  {
    "id": 9,
    "title": "Digital Painting Techniques",
    "category": "Art & Graphic",
    "type": "Offline",
    "image": "painting_img",
    "fee": "20000৳",
    "rating": 4.8,
    "totalRating": 78,
    "totalStudentsEnroll": 260,
    "instructorName": "Carlos Mendez",
    "instructorImg": "instructor_carlos",
    "instructorEmail": "carlos@digitalart.edu",
    "technology": "Photoshop, Corel Painter, Wacom Tablets, Blender",
    "courseStart": "05-April-2025",
    "duration": 12,
    "totalExam": 3,
    "totalProject": 7,
    "details": "This professional digital painting course provides comprehensive training in creating realistic and stylized artwork using digital tools. Over 12 weeks, you'll master Photoshop and Corel Painter while developing fundamental painting skills applicable to any medium. The curriculum covers color theory, brush techniques, texture creation, and lighting principles. You'll complete seven projects including portrait studies, environment paintings, and conceptual artwork. Special modules focus on matte painting techniques and integrating 3D elements from Blender. Each week includes live painting demonstrations, technique breakdowns, and personalized feedback sessions. The course culminates with a personal project where you'll create a series of cohesive digital paintings showcasing your technical skills and artistic voice. Whether you're preparing for concept art roles, illustration work, or personal artistic growth, this course provides the structured training and professional guidance to elevate your digital painting abilities."
  },
  {
    "id": 10,
    "title": "Responsive Web Design",
    "category": "Web Technology",
    "type": "Online",
    "image": "responsive_img",
    "fee": "16000৳",
    "rating": 4.7,
    "totalRating": 94,
    "totalStudentsEnroll": 410,
    "instructorName": "Aisha Johnson",
    "instructorImg": "instructor_aisha",
    "instructorEmail": "aisha@webdesign.com",
    "technology": "HTML5, CSS3, Flexbox, Grid, Media Queries, Bootstrap",
    "courseStart": "08-April-2025",
    "duration": 6,
    "totalExam": 4,
    "totalProject": 5,
    "details": "This practical responsive web design course teaches you to create websites that adapt beautifully to all devices and screen sizes. Over 6 intensive weeks, you'll master modern CSS techniques including Flexbox, Grid, and responsive units. The curriculum covers mobile-first development, accessibility considerations, and performance optimization. You'll build five responsive websites from scratch, including a portfolio site, blog layout, and e-commerce product page. Hands-on exercises focus on fluid typography, responsive images, and progressive enhancement strategies. The course includes frameworks like Bootstrap but emphasizes understanding the underlying CSS principles. For the final project, you'll redesign an existing website with a fully responsive implementation, testing across multiple devices and browsers. Graduates will be able to create websites that provide optimal viewing experiences across the full range of modern devices, from mobile phones to large desktop displays."
  },
  {
    "id": 11,
    "title": "Brand Identity Design",
    "category": "Design",
    "type": "Offline",
    "image": "branding_img",
    "fee": "24000৳",
    "rating": 4.8,
    "totalRating": 67,
    "totalStudentsEnroll": 230,
    "instructorName": "Emma Davis",
    "instructorImg": "instructor_emma_d",
    "instructorEmail": "emma@branddesign.com",
    "technology": "Illustrator, Photoshop, InDesign, Figma, Brand Guidelines",
    "courseStart": "12-April-2025",
    "duration": 10,
    "totalExam": 3,
    "totalProject": 6,
    "details": "This professional brand identity course provides comprehensive training in creating cohesive visual identities for businesses and organizations. Over 10 weeks, you'll master the complete branding process from research and concept development to final implementation. The curriculum covers logo design, typography systems, color psychology, and visual language development. You'll complete six projects including logo suites, stationery systems, and brand guideline documents. Special modules focus on client presentation techniques and adapting designs across various media (print, digital, environmental). Each week includes case studies of successful brands, design critiques, and practical exercises. The course culminates with a capstone project where you'll develop a complete brand identity for a fictional company, including all visual assets and application examples. Graduates will be equipped to create professional-grade brand systems that communicate effectively and stand out in competitive markets."
  },
  {
    "id": 12,
    "title": "Web Animation Techniques",
    "category": "Web Technology",
    "type": "Online",
    "image": "web_animation_img",
    "fee": "19000৳",
    "rating": 4.6,
    "totalRating": 82,
    "totalStudentsEnroll": 350,
    "instructorName": "Kevin Nguyen",
    "instructorImg": "instructor_kevin",
    "instructorEmail": "kevin@frontend.dev",
    "technology": "CSS Animations, GSAP, SVG, Canvas, WebGL Basics",
    "courseStart": "15-April-2025",
    "duration": 8,
    "totalExam": 4,
    "totalProject": 5,
    "details": "This dynamic web animation course teaches you to create engaging, interactive animations that enhance user experience without compromising performance. Over 8 weeks, you'll master CSS animations and transitions before progressing to JavaScript animation with GSAP. The curriculum covers SVG animation techniques, canvas animations, and WebGL fundamentals. You'll complete five projects including micro-interactions, loading animations, and interactive infographics. Hands-on exercises focus on animation principles, timing, and easing functions. The course includes performance optimization techniques and accessibility considerations for animated content. For the final project, you'll design and implement an interactive animated website that showcases all the techniques learned. Graduates will be able to add professional-quality animations to web projects that delight users while maintaining fast load times and smooth performance across devices."
  },
  {
    "id": 13,
    "title": "Character Design Workshop",
    "category": "Art & Graphic",
    "type": "Hybrid",
    "image": "character_design_img",
    "fee": "21000৳",
    "rating": 4.7,
    "totalRating": 58,
    "totalStudentsEnroll": 190,
    "instructorName": "Sophie Martinez",
    "instructorImg": "instructor_sophie",
    "instructorEmail": "sophie@characterdesign.com",
    "technology": "Procreate, Photoshop, ZBrush, Blender, Anatomy",
    "courseStart": "18-April-2025",
    "duration": 12,
    "totalExam": 2,
    "totalProject": 8,
    "details": "This intensive character design course provides comprehensive training in creating memorable characters for games, animation, and illustration. Over 12 weeks, you'll master the complete character development process from initial concept to final presentation. The curriculum covers human and creature anatomy, facial expressions, costume design, and personality development. You'll complete eight projects including character turnarounds, expression sheets, and action poses. Special modules focus on 3D character modeling basics in ZBrush and Blender. Each week includes live drawing demonstrations, anatomy studies, and style development exercises. The course culminates with a character bible project where you'll develop a complete original character with backstory, personality traits, and visual exploration. Whether you're preparing for concept art roles or developing characters for personal projects, this course provides the structured training and professional feedback to elevate your character design skills."
  },
  {
    "id": 14,
    "title": "Frontend Performance Optimization",
    "category": "Web Technology",
    "type": "Online",
    "image": "performance_img",
    "fee": "17000৳",
    "rating": 4.7,
    "totalRating": 73,
    "totalStudentsEnroll": 280,
    "instructorName": "Rajesh Kumar",
    "instructorImg": "instructor_rajesh",
    "instructorEmail": "rajesh@webperformance.com",
    "technology": "Lighthouse, Webpack, Code Splitting, Caching, CDN",
    "courseStart": "22-April-2025",
    "duration": 6,
    "totalExam": 5,
    "totalProject": 4,
    "details": "This technical frontend performance course teaches you to analyze and optimize website speed and efficiency. Over 6 intensive weeks, you'll master performance auditing tools like Lighthouse and WebPageTest. The curriculum covers critical rendering path optimization, code splitting strategies, and asset optimization techniques. You'll work on four real-world projects where you'll diagnose performance issues and implement solutions. Hands-on exercises focus on Webpack configuration, lazy loading implementation, and effective caching strategies. The course includes advanced topics like service workers for offline functionality and CDN optimization. For the final project, you'll take an existing slow website and optimize it to achieve top performance scores, documenting your process and results. Graduates will be able to significantly improve the loading speed and responsiveness of any web application, leading to better user experiences and higher search engine rankings."
  },
  {
    "id": 15,
    "title": "Packaging Design",
    "category": "Design",
    "type": "Offline",
    "image": "packaging_img",
    "fee": "23000৳",
    "rating": 4.6,
    "totalRating": 49,
    "totalStudentsEnroll": 170,
    "instructorName": "Natalie Chen",
    "instructorImg": "instructor_natalie",
    "instructorEmail": "natalie@packagingdesign.com",
    "technology": "Illustrator, Photoshop, Dimension, Structural Design",
    "courseStart": "25-April-2025",
    "duration": 10,
    "totalExam": 3,
    "totalProject": 6,
    "details": "This professional packaging design course provides comprehensive training in creating eye-catching, functional product packaging. Over 10 weeks, you'll master the complete packaging design process from concept to 3D mockup. The curriculum covers structural design principles, material selection, printing techniques, and sustainability considerations. You'll complete six projects including box designs, label systems, and retail displays. Special modules focus on Adobe Dimension for photorealistic 3D mockups and dieline creation. Each week includes case studies of successful packaging, design critiques, and hands-on exercises. The course culminates with a capstone project where you'll develop a complete packaging system for a product line, including structural design, graphics, and 3D presentations. Graduates will be equipped to create professional packaging designs that stand out on shelves while meeting all functional requirements and production constraints."
  },
  {
    "id": 16,
    "title": "Web Accessibility Standards",
    "category": "Web Technology",
    "type": "Online",
    "image": "accessibility_img",
    "fee": "15000৳",
    "rating": 4.5,
    "totalRating": 64,
    "totalStudentsEnroll": 240,
    "instructorName": "Priya Sharma",
    "instructorImg": "instructor_priya",
    "instructorEmail": "priya@accessibleweb.com",
    "technology": "WCAG, ARIA, Screen Readers, Keyboard Navigation",
    "courseStart": "28-April-2025",
    "duration": 6,
    "totalExam": 4,
    "totalProject": 5,
    "details": "This essential web accessibility course teaches you to create websites that everyone can use, regardless of ability. Over 6 weeks, you'll master WCAG guidelines and practical implementation techniques. The curriculum covers semantic HTML, ARIA attributes, keyboard navigation, and screen reader compatibility. You'll complete five projects where you'll audit existing websites and implement accessibility improvements. Hands-on exercises focus on color contrast analysis, focus management, and accessible form design. The course includes assistive technology demonstrations and disability awareness training. For the final project, you'll take an inaccessible website and transform it into a WCAG-compliant experience, documenting your process and decisions. Graduates will be able to evaluate websites for accessibility issues, implement solutions, and advocate for inclusive design practices in their organizations. These skills are increasingly in demand as accessibility becomes a legal requirement in many jurisdictions."
  },
  {
    "id": 17,
    "title": "Digital Sculpting with ZBrush",
    "category": "Art & Graphic",
    "type": "Online",
    "image": "zbrush_img",
    "fee": "26000৳",
    "rating": 4.8,
    "totalRating": 42,
    "totalStudentsEnroll": 150,
    "instructorName": "Chris Thompson",
    "instructorImg": "instructor_chris",
    "instructorEmail": "chris@digitalsculpt.com",
    "technology": "ZBrush, Maya, Substance Painter, Marvellous Designer",
    "courseStart": "02-May-2025",
    "duration": 14,
    "totalExam": 2,
    "totalProject": 7,
    "details": "This professional digital sculpting course provides comprehensive training in ZBrush for creating detailed 3D characters and creatures. Over 14 weeks, you'll master ZBrush's unique interface and powerful sculpting tools. The curriculum covers human anatomy, clothing simulation, hard surface modeling, and texture painting. You'll complete seven projects including portrait busts, full character sculptures, and creature designs. Special modules focus on integrating with Maya for retopology and Substance Painter for texturing. Each week includes live sculpting demonstrations, anatomy studies, and technique breakdowns. The course culminates with a personal project where you'll create a high-resolution character model with detailed textures and presentation renders. Whether you're preparing for character artist roles in games or film, or developing personal art projects, this course provides the structured training and professional feedback to master digital sculpting in ZBrush."
  },
  {
    "id": 18,
    "title": "Design Systems with Figma",
    "category": "Design",
    "type": "Hybrid",
    "image": "design_systems_img",
    "fee": "20000৳",
    "rating": 4.7,
    "totalRating": 88,
    "totalStudentsEnroll": 320,
    "instructorName": "Emma Davis",
    "instructorImg": "instructor_emma_d",
    "instructorEmail": "emma@figmadesign.com",
    "technology": "Figma, Storybook, Tokens, Auto-Layout, Components",
    "courseStart": "05-May-2025",
    "duration": 8,
    "totalExam": 3,
    "totalProject": 5,
    "details": "This professional design systems course teaches you to create scalable, consistent design systems using Figma. Over 8 weeks, you'll master component creation, auto-layout, and variant management. The curriculum covers design tokens, documentation strategies, and developer handoff processes. You'll build five progressively complex systems including a mobile app UI kit and enterprise design system. Hands-on exercises focus on creating reusable components, establishing naming conventions, and maintaining version control. The course includes integration with Storybook for design-system documentation and collaboration techniques for distributed teams. For the final project, you'll develop a complete design system for a fictional product, including all components, documentation, and implementation examples. Graduates will be able to architect and maintain professional design systems that streamline product development and ensure visual consistency across large projects and teams."
  },
  {
    "id": 19,
    "title": "Progressive Web Apps",
    "category": "Web Technology",
    "type": "Online",
    "image": "pwa_img",
    "fee": "21000৳",
    "rating": 4.7,
    "totalRating": 76,
    "totalStudentsEnroll": 290,
    "instructorName": "Thomas Lee",
    "instructorImg": "instructor_thomas",
    "instructorEmail": "thomas@pwa.dev",
    "technology": "Service Workers, Web App Manifest, IndexedDB, Cache API",
    "courseStart": "08-May-2025",
    "duration": 8,
    "totalExam": 5,
    "totalProject": 4,
    "details": "This cutting-edge PWA course teaches you to build web applications that rival native apps in capability and user experience. Over 8 weeks, you'll master service workers for offline functionality and background sync. The curriculum covers web app manifests for home screen installation, IndexedDB for client-side storage, and the Cache API for asset management. You'll complete four projects including an offline-first application, a photo editor with local storage, and a data visualization dashboard with background sync. Hands-on exercises focus on performance optimization, push notifications, and update strategies. The course includes techniques for graceful degradation and cross-browser compatibility. For the final project, you'll convert an existing website into a full-featured Progressive Web App, implementing all core PWA technologies. Graduates will be able to create web applications that work reliably regardless of network conditions, providing app-like experiences that can be installed on users' devices."
  },
  {
    "id": 20,
    "title": "Typography for Digital Media",
    "category": "Design",
    "type": "Online",
    "image": "typography_img",
    "fee": "17000৳",
    "rating": 4.6,
    "totalRating": 63,
    "totalStudentsEnroll": 230,
    "instructorName": "Michael Brown",
    "instructorImg": "instructor_michael_b",
    "instructorEmail": "michael@type.design",
    "technology": "Variable Fonts, CSS Typography, Typekit, Fluid Typography",
    "courseStart": "12-May-2025",
    "duration": 6,
    "totalExam": 3,
    "totalProject": 5,
    "details": "This specialized typography course focuses on effective type use in digital interfaces and web design. Over 6 weeks, you'll master web font implementation, responsive typography techniques, and hierarchy establishment. The curriculum covers variable fonts, CSS typography properties, and performance considerations for web fonts. You'll complete five projects including a type specimen website, a responsive article layout, and a UI type system. Hands-on exercises focus on pairing fonts, establishing vertical rhythm, and creating accessible text experiences. The course includes technical implementation alongside artistic principles of typography. For the final project, you'll design and implement a complete typographic system for a website, documenting your type choices and implementation details. Graduates will be able to create sophisticated, readable typographic systems that enhance user experience and brand communication in digital products."
  },
  {
    "id": 21,
    "title": "WebGL and 3D on the Web",
    "category": "Web Technology",
    "type": "Online",
    "image": "webgl_img",
    "fee": "25000৳",
    "rating": 4.7,
    "totalRating": 51,
    "totalStudentsEnroll": 180,
    "instructorName": "Kevin Nguyen",
    "instructorImg": "instructor_kevin",
    "instructorEmail": "kevin@web3d.dev",
    "technology": "Three.js, WebGL, GLSL, Blender, 3D Modeling",
    "courseStart": "15-May-2025",
    "duration": 12,
    "totalExam": 4,
    "totalProject": 6,
    "details": "This advanced WebGL course teaches you to create stunning 3D experiences that run directly in web browsers. Over 12 weeks, you'll master Three.js fundamentals before exploring more advanced WebGL concepts. The curriculum covers 3D model preparation in Blender, scene composition, lighting techniques, and animation. You'll complete six projects including product visualizations, data visualizations, and interactive 3D environments. Hands-on exercises focus on performance optimization, responsive 3D design, and user interaction patterns. The course includes shader programming basics with GLSL and physics simulation integration. For the final project, you'll create an interactive 3D experience that showcases all the techniques learned, with attention to performance and user experience. Graduates will be able to implement sophisticated 3D content on the web, opening possibilities for immersive product showcases, educational tools, and creative web experiences that stand out in today's competitive digital landscape."
  },
  {
    "id": 22,
    "title": "Concept Art for Games",
    "category": "Art & Graphic",
    "type": "Offline",
    "image": "concept_art_img",
    "fee": "27000৳",
    "rating": 4.8,
    "totalRating": 47,
    "totalStudentsEnroll": 160,
    "instructorName": "Sophia Rodriguez",
    "instructorImg": "instructor_sophia",
    "instructorEmail": "sophia@gameart.edu",
    "technology": "Photoshop, Procreate, Blender, Speed Painting",
    "courseStart": "18-May-2025",
    "duration": 14,
    "totalExam": 2,
    "totalProject": 8,
    "details": "This professional concept art course provides comprehensive training in creating game assets and environments. Over 14 weeks, you'll master the complete concept art pipeline from thumbnails to final production paintings. The curriculum covers environment design, prop design, and keyframe illustration techniques. You'll complete eight projects including mood boards, location concepts, and hero asset designs. Special modules focus on speed painting techniques and 3D blockout integration using Blender. Each week includes live painting demonstrations, art direction exercises, and industry workflow simulations. The course culminates with a game art bible project where you'll develop a cohesive set of concepts for a fictional game world, including characters, environments, and key assets. Whether you're preparing for game industry roles or developing personal projects, this course provides the structured training and professional feedback to excel in game concept art. Graduates will have a portfolio demonstrating their ability to create production-ready game art concepts."
  }
]
