[
  {
    "id": 1,
    "title": "Advanced MERN Stack Development",
    "category": "Programming",
    "type": "Offline",
    "image": "https://i.ibb.co.com/XZ78JQ9f/Mern-card.jpg",
    "fee": "40000৳",
    "rating": 4.9,
    "totalRating": 128,
    "totalStudentsEnroll": 50,
    "instructorName": "Sheikh Sakibul Hasan",
    "instructorImg": "https://scontent.fdac41-1.fna.fbcdn.net/v/t39.30808-6/472009300_557526777119280_533781909713140935_n.jpg?_nc_cat=105&ccb=1-7&_nc_sid=6ee11a&_nc_ohc=PgqtReB_wTIQ7kNvwEW6HBA&_nc_oc=AdlYMwxf0QzOQXCxdf1rdZMoj2KwcDQJb2l0A8HT-t4J3BPX8CV8AEyxVD7MlaaIblU&_nc_zt=23&_nc_ht=scontent.fdac41-1.fna&_nc_gid=yKv3AVA5Vu9NUfEgYyy5aA&oh=00_AfLmbO6nbSRTMAuOY34_Fial78mpD1Rpz-dHK-vx1S2Xfg&oe=68218C51",
    "instructorEmail": "sakib@bdcalling.com",
    "technology": "MongoDB, Express.js, React, Node.js, Redux",
    "courseStart": "12-March-2025",
    "duration": 6,
    "lectures": 50,
    "totalExam": 6,
    "totalProject": 5,
    "details": "This course teaches full-stack web development using MongoDB, Express.js, React, and Node.js. You'll learn to build modern applications with Redux for state management, RESTful APIs, authentication, and deployment strategies. The curriculum includes 50 lectures, 5 projects, and career preparation.",
    "courseOverview": "The Advanced MERN Stack Development course is a 6-month immersive program designed to transform beginners into job-ready full-stack developers. The course begins with a thorough grounding in JavaScript fundamentals, including ES6+ features, asynchronous programming, and functional programming concepts. Students then progress to React.js, learning component-based architecture, hooks, and context API for state management. The backend portion covers Node.js and Express.js in depth, teaching students to build secure, scalable REST APIs with proper middleware implementation. Database instruction focuses on MongoDB, including schema design, aggregation pipelines, and performance optimization. A significant portion of the course is dedicated to integrating frontend and backend systems, covering CORS, JWT authentication, and API consumption patterns. Students will work with Redux for complex state management and learn to implement server-side rendering for improved SEO. The curriculum includes modern tooling like Webpack, Babel, and ESLint, along with testing frameworks like Jest and Mocha. Real-world projects include building an e-commerce platform with payment integration, a social media dashboard with real-time updates, and a content management system. The course concludes with deployment strategies using platforms like Heroku, AWS, and Netlify, along with CI/CD pipeline setup. Career preparation modules cover technical interview strategies, open-source contributions, and freelancing best practices for MERN developers.",
    "curriculum": [
      "Overview of HTML",
      "Overview of CSS",
      "Overview of Tailwind",
      "Introduction to JS Variables, condition",
      "Array, object, function, Loop",
      "JS Problem solving",
      "JS advance map(), filter(), reduce(), ()=>",
      "Document Object Model (DOM)",
      "JavaScript object notation (JSON)",
      "Different ways of Data faces",
      "React core concept",
      "React Router Concept",
      "Node JS",
      "Express JS",
      "MongoDB",
      "API",
      "CRUD",
      "Authentication",
      "Authorization",
      "Full Stack",
      "Typescript",
      "Mongoose",
      "Advance NoSQL Backend",
      "Advance Backend Project",
      "Merge front end and back end",
      "Technique development & client handle",
      "Fiverr Marketplace",
      "Career Guideline, Presentation & CV Making"
    ],
    "courseIncludes": [
      {
        "icon": "RiLiveLine",
        "text": "50+ Live Design Sessions"
      },
      {
        "icon": "RiExpandLeftRightLine",
        "text": "6+ Client Simulation Projects"
      },
      {
        "icon": "RiComputerLine",
        "text": "Design Software Lab Access"
      },
      {
        "icon": "MdLiveTv",
        "text": "Portfolio & Pitch Review"
      },
      {
        "icon": "TfiCup",
        "text": "Freelance Certification"
      },
      {
        "icon": "MdWorkOutline",
        "text": "Freelancer Toolkit (Templates, Contracts)"
      }
    ],
    "softwareYoullLearn": [
      "Node.js",
      "MongoDB Atlas",
      "Express.js",
      "React.js",
      "VS Code"
    ],
    "jobPositions": [
      "Full Stack Developer",
      "Back-end Developer",
      "Front-end Developer",
      "Web Application Developer"
    ]
  },
  {
    "id": 2,
    "title": "Professional Graphic Design With AI",
    "category": "Art & Design",
    "type": "Offline",
    "image": "https://i.ibb.co.com/zWvWjS9X/GD-Card-1.jpg",
    "fee": "15000৳",
    "rating": 4.9,
    "totalRating": 110,
    "totalStudentsEnroll": 50,
    "instructorName": "Mahabubur Rahman",
    "instructorImg": "https://api.bdcallingacademy.com/adminAsset/image/1983846654.jpg",
    "instructorEmail": "mahabub@bdcalling.com",
    "technology": "Adobe Photoshop, Illustrator, InDesign, Branding, Typography",
    "courseStart": "26-March-2025",
    "duration": 4,
    "lectures": 50,
    "totalExam": 3,
    "totalProject": 5,
    "details": "Learn graphic design fundamentals using Adobe Photoshop, Illustrator, and AI tools like Adobe Firefly. Build branding materials, logos, and digital assets while mastering client communication and freelancing techniques.",
    "courseOverview": "This comprehensive 4-month graphic design program begins with foundational design principles, teaching students about composition, visual hierarchy, and color psychology. The first module focuses on Adobe Photoshop, covering photo manipulation, retouching techniques, and digital painting with AI-assisted tools. Students then progress to vector graphics in Adobe Illustrator, learning logo design, icon creation, and advanced path manipulation. The course introduces AI integration through Adobe Firefly, demonstrating how to generate design elements, enhance creativity, and streamline workflows. Typography modules explore font pairing, hierarchy, and expressive type treatments, while branding sections cover visual identity development from concept to style guides. Print design units include business cards, brochures, and packaging, with attention to bleed, CMYK preparation, and press requirements. Digital design components focus on social media assets, web graphics, and UI elements. Students will complete 5 major projects including a brand identity package, product packaging series, and advertising campaign. The curriculum also addresses client communication, design presentations, and freelancing strategies. Advanced topics include 3D mockups, isometric illustrations, and AI-powered batch processing. Career preparation includes portfolio development, Behance profile setup, and freelancer toolkit resources. The course culminates in a capstone project where students rebrand a real or fictional company, demonstrating mastery of both traditional and AI-enhanced design techniques.",
    "curriculum": [
      "Starting Adobe Photoshop Design",
      "Image Manipulation",
      "Photoshop Typography",
      "Social Media & YouTube Thumbnail Design",
      "Flyer Creation",
      "Behance Portfolio",
      "Adobe Firefly",
      "Introducing Illustrator",
      "Stroke Plate Details & Mesh Tool",
      "Advanced Typography Techniques",
      "Flyer & Brochure",
      "Freelancing",
      "Brush tool & Pen tool",
      "Advanced Blend Technique",
      "Hair Masking & Action Work",
      "Business & Visiting Card Design",
      "Introduction to Mock-up",
      "Introduction to Artificial Intelligence",
      "Introduction Different AI",
      "Advance Gradient Technique",
      "Instruction to Pathfinder Operation",
      "Logo Design",
      "Product Packaging",
      "Career Guidelines, Presentation & CV Making"
    ],
    "courseIncludes": [
      {
        "icon": "RiLiveLine",
        "text": "50+ Live Design Sessions"
      },
      {
        "icon": "RiExpandLeftRightLine",
        "text": "6+ Client Simulation Projects"
      },
      {
        "icon": "RiComputerLine",
        "text": "Design Software Lab Access"
      },
      {
        "icon": "MdLiveTv",
        "text": "Portfolio & Pitch Review"
      },
      {
        "icon": "TfiCup",
        "text": "Freelance Certification"
      },
      {
        "icon": "MdWorkOutline",
        "text": "Freelancer Toolkit (Templates, Contracts)"
      }
    ],
    "softwareYoullLearn": [
      "Adobe Photoshop",
      "Adobe Illustrator",
      "Adobe InDesign",
      "Adobe Firefly"
    ],
    "jobPositions": [
      "Graphic Designer",
      "Brand Identity Designer",
      "Product Designer",
      "Social Media Designer",
      "Visual Designer",
      "Art Director",
      "Illustrator"
    ]
  },
  {
    "id": 3,
    "title": "Certified Digital Marketing Specialist",
    "category": "Marketing",
    "type": "Offline",
    "image": "https://i.ibb.co.com/GvS6k4FJ/DM-caed.jpg",
    "fee": "16000৳",
    "rating": 4.7,
    "totalRating": 102,
    "totalStudentsEnroll": 50,
    "instructorName": "Asraf Hossen",
    "instructorImg": "https://api.bdcallingacademy.com/adminAsset/image/1763751529.jpg",
    "instructorEmail": "david@marketgenius.com",
    "technology": "SEO, SEM, Facebook Ads, Google Ads, Email Marketing",
    "courseStart": "18-March-2025",
    "duration": 3,
    "lectures": 50,
    "totalExam": 3,
    "totalProject": 4,
    "details": "Master SEO, Google Ads, Facebook Ads, email marketing, and analytics tools. Gain skills in campaign planning, conversion optimization, and e-commerce marketing through real-world projects.",
    "courseOverview": "This intensive 3-month digital marketing program begins with foundational concepts including the digital marketing landscape, consumer behavior online, and the customer journey. The first module focuses on search engine optimization (SEO), teaching on-page optimization, technical SEO audits, and link-building strategies using tools like SEMrush and Ahrefs. Students then progress to search engine marketing (SEM), learning to create and optimize Google Ads campaigns with conversion tracking and remarketing. Social media marketing units cover Facebook and Instagram advertising, including audience targeting, ad creative development, and campaign budgeting. Content marketing modules explore blog strategy, video marketing, and influencer collaborations. Email marketing sections teach list building, automation sequences, and performance analysis. The course includes comprehensive training in Google Analytics and Data Studio for campaign measurement and reporting. Students will complete 4 practical projects including a full SEO audit, paid advertising campaign setup, and social media strategy development. Conversion rate optimization techniques cover landing page design, A/B testing, and heatmap analysis. E-commerce marketing units focus on product listing ads, shopping feeds, and Amazon marketing strategies. The curriculum also addresses marketing automation, CRM integration, and omnichannel marketing approaches. Career preparation includes freelancing guidance, agency work simulations, and certification in Google Ads and Analytics. The program culminates with students developing a complete digital marketing plan for a real business, incorporating all channels and performance metrics.",
    "curriculum": [
      "Introduction To Digital Marketing",
      "Social Media Marketing and Monetization",
      "SEO & SEM",
      "On-Page, Off-Page, Technical, and Local SEO",
      "E-commerce SEO & YouTube SEO",
      "E-mail Marketing & E-commerce Marketing",
      "Affiliate Marketing",
      "Google Ads - Conversion tracking",
      "Real Project",
      "Marketplace",
      "Client Communication"
    ],
    "courseIncludes": [
      {
        "icon": "RiLiveLine",
        "text": "50+ Live Design Sessions"
      },
      {
        "icon": "RiExpandLeftRightLine",
        "text": "6+ Client Simulation Projects"
      },
      {
        "icon": "RiComputerLine",
        "text": "Design Software Lab Access"
      },
      {
        "icon": "MdLiveTv",
        "text": "Portfolio & Pitch Review"
      },
      {
        "icon": "TfiCup",
        "text": "Freelance Certification"
      },
      {
        "icon": "MdWorkOutline",
        "text": "Freelancer Toolkit (Templates, Contracts)"
      }
    ],
    "softwareYoullLearn": ["SEMRUSH", "MOZ", "Screaming Frog", "Ahrefs"],
    "jobPositions": [
      "Social Media Marketer",
      "Google Ads Specialist",
      "E-Commerce Marketer",
      "SEO Specialist",
      "Affiliate Marketer",
      "Digital Marketing Consultant"
    ]
  },
  {
    "id": 4,
    "title": "Certified WordPress Theme Development",
    "category": "Programming",
    "type": "Offline",
    "image": "https://i.ibb.co.com/Y75bjF7c/WP-card.jpg",
    "fee": "18000৳",
    "rating": 4.7,
    "totalRating": 85,
    "totalStudentsEnroll": 50,
    "instructorName": "Sheikh Sakibul Hasan",
    "instructorImg": "https://scontent.fdac41-1.fna.fbcdn.net/v/t39.30808-6/472009300_557526777119280_533781909713140935_n.jpg?_nc_cat=105&ccb=1-7&_nc_sid=6ee11a&_nc_ohc=PgqtReB_wTIQ7kNvwEW6HBA&_nc_oc=AdlYMwxf0QzOQXCxdf1rdZMoj2KwcDQJb2l0A8HT-t4J3BPX8CV8AEyxVD7MlaaIblU&_nc_zt=23&_nc_ht=scontent.fdac41-1.fna&_nc_gid=yKv3AVA5Vu9NUfEgYyy5aA&oh=00_AfLmbO6nbSRTMAuOY34_Fial78mpD1Rpz-dHK-vx1S2Xfg&oe=68218C51",
    "instructorEmail": "sakib@bdcalling.com",
    "technology": "WordPress, PHP, HTML, CSS, JavaScript, Theme Development, Custom Post Types",
    "courseStart": "26-March-2025",
    "duration": 3,
    "lectures": 50,
    "totalExam": 3,
    "totalProject": 4,
    "details": "Build custom WordPress themes from scratch with PHP, HTML, CSS, and JavaScript. Learn WooCommerce integration, SEO optimization, security practices, and how to sell services on freelance platforms.",
    "courseOverview": "This 3-month intensive WordPress development course begins with foundational web technologies including HTML5, CSS3, and basic PHP syntax. Students first learn WordPress fundamentals - installation, configuration, and the dashboard ecosystem. The core curriculum then progresses to theme development, starting with child themes and advancing to building custom themes from scratch. Participants master the WordPress template hierarchy, learning to create template files for all post types and archive pages. PHP modules focus specifically on WordPress functions, hooks (actions and filters), and the WordPress Query. Advanced topics include custom post types, taxonomies, and metadata with Advanced Custom Fields. Theme development units cover responsive design techniques, accessibility standards, and performance optimization strategies. Students learn to integrate JavaScript and AJAX for dynamic front-end interactions. The course includes comprehensive WooCommerce training for eCommerce sites, covering product displays, cart functionality, and payment gateway integration. Security modules teach hardening WordPress installations, preventing common vulnerabilities, and implementing proper user capabilities. Development tools covered include WP-CLI, debugging techniques, and version control with Git. Students complete 4 projects including a custom blog theme, business website with custom post types, eCommerce site, and a headless WordPress setup with React. The curriculum also covers plugin development basics, REST API integration, and headless WordPress architectures. Career preparation includes freelancing strategies for WordPress developers, theme marketplace submissions, and client management techniques. The program culminates with students building a professional-grade custom theme with all modern development standards and deployment workflows.",
    "curriculum": [
      "Introduction to Web Development & Hosting",
      "Introduction to Bootstrap for Responsive Design",
      "Theme Setup and Customization",
      "WooCommerce for eCommerce Websites",
      "SEO Optimization for WordPress Sites",
      "Security & Backup Management",
      "Selling Services on Freelance Marketplaces (Fiverr, Upwork)",
      "Career Guidance & CV Preparation",
      "HTML & CSS Basics for WordPress Customization",
      "WordPress Installation & Dashboard Overview",
      "Elementor Page Builder & Advanced Customization",
      "Payment Gateway Integration",
      "Website Speed Optimization Techniques",
      "Live Project: Building a WordPress Website",
      "Client Communication & Proposal Writing"
    ],
    "courseIncludes": [
      {
        "icon": "RiLiveLine",
        "text": "50+ Live Design Sessions"
      },
      {
        "icon": "RiExpandLeftRightLine",
        "text": "6+ Client Simulation Projects"
      },
      {
        "icon": "RiComputerLine",
        "text": "Design Software Lab Access"
      },
      {
        "icon": "MdLiveTv",
        "text": "Portfolio & Pitch Review"
      },
      {
        "icon": "TfiCup",
        "text": "Freelance Certification"
      },
      {
        "icon": "MdWorkOutline",
        "text": "Freelancer Toolkit (Templates, Contracts)"
      }
    ],
    "softwareYoullLearn": [
      "WordPress",
      "Elementor",
      "WooCommerce",
      "Adobe Photoshop",
      "Google Analytics"
    ],
    "jobPositions": [
      "WordPress Developer",
      "WooCommerce Specialist",
      "SEO & Speed Optimization Expert",
      "Web Designer",
      "Website Administrator",
      "Freelancer"
    ]
  },
  {
    "id": 5,
    "title": "Advance Web Development with React",
    "category": "Programming",
    "type": "Offline",
    "image": "https://api.bdcallingacademy.com/adminAsset/image/1525850441.jpg",
    "fee": "15000৳",
    "rating": 4.7,
    "totalRating": 115,
    "totalStudentsEnroll": 50,
    "instructorName": "Sheikh Sakibul Hasan",
    "instructorImg": "https://scontent.fdac41-1.fna.fbcdn.net/v/t39.30808-6/472009300_557526777119280_533781909713140935_n.jpg?_nc_cat=105&ccb=1-7&_nc_sid=6ee11a&_nc_ohc=PgqtReB_wTIQ7kNvwEW6HBA&_nc_oc=AdlYMwxf0QzOQXCxdf1rdZMoj2KwcDQJb2l0A8HT-t4J3BPX8CV8AEyxVD7MlaaIblU&_nc_zt=23&_nc_ht=scontent.fdac41-1.fna&_nc_gid=yKv3AVA5Vu9NUfEgYyy5aA&oh=00_AfLmbO6nbSRTMAuOY34_Fial78mpD1Rpz-dHK-vx1S2Xfg&oe=68218C51",
    "instructorEmail": "sakib@bdcalling.com",
    "technology": "React, Hooks, Context API, Redux, React Router, Firebase",
    "courseStart": "16-March-2025",
    "duration": 6,
    "lectures": 50,
    "totalExam": 3,
    "totalProject": 4,
    "details": "Develop modern front-end applications using React, Hooks, Context API, Redux, Firebase, and Tailwind CSS. Build responsive websites and master deployment and testing practices.",
    "courseOverview": "This 6-month intensive React development program begins with core web technologies including HTML5 semantics, CSS3 layouts with Flexbox and Grid, and modern JavaScript (ES6+ features). The React portion starts with fundamentals - JSX, component architecture, and props management. Students then progress to state management using hooks (useState, useEffect, useContext) and learn to build custom hooks for reusable logic. Routing modules cover React Router with dynamic routes, protected routes, and navigation patterns. The course includes comprehensive training in context API for global state and Redux for complex applications. API integration units teach RESTful service consumption, error handling, and loading states. Advanced topics include code splitting, lazy loading, and performance optimization techniques. Authentication modules cover JWT implementation, protected routes, and role-based access control. Students learn to work with Firebase for backend services including authentication, Firestore database, and hosting. The curriculum includes testing with Jest and React Testing Library, covering unit tests, integration tests, and snapshot testing. Styling approaches include CSS Modules, Styled Components, and utility-first CSS with Tailwind. Students complete 4 major projects including a full-stack CRUD application, e-commerce frontend with cart functionality, social media dashboard, and a portfolio site with CMS integration. The course also covers TypeScript with React for type-safe development and debugging techniques using React DevTools. Deployment strategies include static site hosting, server-side rendering with Next.js, and CI/CD pipelines. Career preparation includes GitHub profile optimization, technical interview strategies, and freelancing best practices for React developers. The program culminates with students building a capstone project incorporating all learned concepts with a focus on performance, accessibility, and maintainability.",
    "curriculum": [
      "Fundamentals of Web Development (HTML, CSS, GitHub)",
      "JavaScript Essentials: Variables, Loops, Functions & DOM Manipulation",
      "Introduction to React: JSX, Components, Props & State",
      "API Integration & Fetching Data in React Applications",
      "State Management in React with Context API",
      "Debugging & Performance Optimization in React Applications",
      "Freelancing in Web Development: Finding Clients & Pricing Services",
      "Capstone Project: Building a Complete React-Based Website",
      "Responsive Web Design using Tailwind CSS",
      "Advanced JavaScript: Objects, Arrays, ES6+ Features & Async Programming",
      "Working with React Router & Dynamic Routing",
      "UI Frameworks & Converting Figma/PSD Designs to React",
      "Full-Scale React Projects (Newspaper, Job Portal, Portfolio Websites)",
      "Web Deployment & Hosting Platforms",
      "Career Preparation: Resume Writing & Technical Interviews"
    ],
    "courseIncludes": [
      {
        "icon": "RiLiveLine",
        "text": "50+ Live Design Sessions"
      },
      {
        "icon": "RiExpandLeftRightLine",
        "text": "6+ Client Simulation Projects"
      },
      {
        "icon": "RiComputerLine",
        "text": "Design Software Lab Access"
      },
      {
        "icon": "MdLiveTv",
        "text": "Portfolio & Pitch Review"
      },
      {
        "icon": "TfiCup",
        "text": "Freelance Certification"
      },
      {
        "icon": "MdWorkOutline",
        "text": "Freelancer Toolkit (Templates, Contracts)"
      }
    ],
    "softwareYoullLearn": [
      "Visual Studio Code",
      "Git & GitHub",
      "Tailwind CSS",
      "React.js",
      "Figma & Photoshop",
      "Netlify & Vercel"
    ],
    "jobPositions": [
      "Front-End Developer",
      "Web Application Developer",
      "Freelance Web Developer",
      "React Developer",
      "Software Engineer (Front-End)"
    ]
  },
  {
    "id": 6,
    "title": "Certified UX/UI Design",
    "category": "Art & Design",
    "type": "Offline",
    "image": "https://i.ibb.co.com/whHBvX3d/ui-website-card.jpg",
    "fee": "20000৳",
    "rating": 4.7,
    "totalRating": 98,
    "totalStudentsEnroll": 50,
    "instructorName": "Md. Zayed Uddin",
    "instructorImg": "instructor_zayed",
    "instructorEmail": "zayed@bdcalling.com",
    "technology": "Figma, Adobe XD, UX Research, Wireframing, Prototyping, Storyboarding",
    "courseStart": "25-March-2025",
    "duration": 3,
    "lectures": 50,
    "totalExam": 3,
    "totalProject": 4,
    "details": "Create user-centered digital products using Figma and Adobe XD. Learn research methods, wireframing, prototyping, usability testing, and portfolio development.",
    "courseOverview": "This 3-month intensive UX/UI design program begins with foundational design principles including visual hierarchy, color theory, and typography systems. The first module focuses on user research techniques - conducting interviews, creating empathy maps, and developing user personas. Students then progress to information architecture, learning to create sitemaps and user flows for optimal navigation. Wireframing modules cover low to high-fidelity prototypes using Figma, including responsive design patterns for different devices. Interaction design units teach micro-interactions, animations, and transitional states to enhance usability. UI design components focus on creating design systems with consistent components, typography scales, and color palettes. Usability testing modules cover test planning, moderation techniques, and analyzing results for iterative improvements. Accessibility training ensures designs meet WCAG standards for inclusive design. The course includes comprehensive training in Figma, covering auto-layouts, components, variants, and prototyping features. Students complete 4 major projects including a mobile app redesign, e-commerce website, dashboard interface, and a capstone project of their choice. The curriculum also addresses design handoff processes, developer collaboration, and design documentation. Career preparation includes portfolio development, case study creation, and interview techniques for design roles. Business aspects cover freelancing strategies, client presentations, and design agency workflows. The program culminates with students presenting a complete UX case study incorporating research, wireframes, prototypes, and usability testing results for their portfolio.",
    "curriculum": [
      "UX/UI Design Process",
      "UX/UI Visual Design Principles",
      "Color Theory & Typography in UI",
      "Paper Prototyping Techniques",
      "UX/UI Design for Mobile Apps",
      "Handover Process for Developers",
      "Freelancing in UX/UI Design",
      "Accessibility in UX/UI Design",
      "Design Languages & Material Guidelines",
      "Wireframing for Web Applications",
      "Implementation of UX/UI for Web Apps",
      "Prototyping & User Testing",
      "Portfolio Development for Designers",
      "Career Guidance & CV Preparation"
    ],
    "courseIncludes": [
      {
        "icon": "RiLiveLine",
        "text": "50+ Live Design Sessions"
      },
      {
        "icon": "RiExpandLeftRightLine",
        "text": "6+ Client Simulation Projects"
      },
      {
        "icon": "RiComputerLine",
        "text": "Design Software Lab Access"
      },
      {
        "icon": "MdLiveTv",
        "text": "Portfolio & Pitch Review"
      },
      {
        "icon": "TfiCup",
        "text": "Freelance Certification"
      },
      {
        "icon": "MdWorkOutline",
        "text": "Freelancer Toolkit (Templates, Contracts)"
      }
    ],
    "softwareYoullLearn": [
      "Adobe XD",
      "Figma",
      "Sketch",
      "InVision",
      "Adobe Photoshop",
      "Adobe Illustrator"
    ],
    "jobPositions": [
      "UX/UI Designer",
      "UX Researcher",
      "Information Architect",
      "Interaction Designer",
      "Visual Designer"
    ]
  },
  {
    "id": 7,
    "title": "Certified Video Editing & Motion Graphics",
    "category": "Media & Film",
    "type": "Offline",
    "image": "https://i.ibb.co.com/4wsV2RJk/Video-card.jpg",
    "fee": "30000৳",
    "rating": 4.8,
    "totalRating": 102,
    "totalStudentsEnroll": 50,
    "instructorName": "Md. Zayed Uddin",
    "instructorImg": "instructor_zayed",
    "instructorEmail": "zayed@bdcalling.com",
    "technology": "Adobe Premiere Pro, After Effects, Blender, Mixamo AI, TTS AI, Color Grading",
    "courseStart": "28-March-2025",
    "duration": 3,
    "lectures": 50,
    "totalExam": 4,
    "totalProject": 5,
    "details": "Gain expertise in video editing and motion graphics using Adobe Premiere Pro, After Effects, DaVinci Resolve, and Final Cut Pro. Learn color grading, audio mixing, visual effects, and animation techniques.",
    "courseOverview": "This intensive 3-month video production program begins with foundational concepts in storytelling, shot composition, and editing theory. The first module focuses on Adobe Premiere Pro, teaching professional editing workflows including multicam editing, nested sequences, and advanced trimming techniques. Students then progress to color correction and grading using Lumetri Color tools and DaVinci Resolve for advanced color work. Audio post-production covers noise reduction, mixing, and sound design principles. The motion graphics portion introduces Adobe After Effects, starting with basic animations and progressing to complex compositions with 3D layers and cameras. Visual effects modules cover green screen keying, rotoscoping, and tracking techniques. Typography animation units teach kinetic type and text reveals for impactful messaging. Students learn to create motion graphics templates (MOGRTs) for efficient workflow between Premiere and After Effects. The course includes modern techniques like AI-powered tools for voiceovers (TTS), character animation (Mixamo), and automated editing processes. Students complete 5 major projects including a short film edit, commercial spot, social media content package, motion graphics opener, and a personal demo reel. The curriculum also covers client communication, project management, and freelancing strategies for video professionals. Technical aspects include codecs, export settings for various platforms, and hardware optimization. Career preparation includes portfolio development, reel critique, and job search strategies for the media industry. The program culminates with students producing a complete video project from concept to final delivery, incorporating all learned techniques in editing, motion graphics, and sound design.",
    "curriculum": [
      "Introduction to Visual Media & Motion Graphics",
      "Basics of Design Principles, Composition & Storytelling",
      "Adobe Premiere Pro: Video Editing & Workflow Optimization",
      "Adding Motion Graphics, Titles & Custom Transitions",
      "Audio Editing, Sound Design & Synchronization",
      "Green Screen Techniques & Visual Effects Integration",
      "Advanced Color Grading with DaVinci Resolve",
      "After Effects: Keyframes, Animation & Masking Techniques",
      "3D Layers, Camera Animations & Motion Tracking",
      "Expressions & Automation for Dynamic Effects",
      "Creating Reusable Motion Graphics Templates (MOGRTs)",
      "Multi-Software Workflow: Premiere Pro, After Effects & Resolve",
      "Exporting & Optimizing Videos for Different Platforms",
      "Freelancing & Industry Insights in Motion Graphics",
      "Capstone Project: Complete Video Production & Portfolio Creation"
    ],
    "courseIncludes": [
      {
        "icon": "RiLiveLine",
        "text": "50+ Live Design Sessions"
      },
      {
        "icon": "RiExpandLeftRightLine",
        "text": "6+ Client Simulation Projects"
      },
      {
        "icon": "RiComputerLine",
        "text": "Design Software Lab Access"
      },
      {
        "icon": "MdLiveTv",
        "text": "Portfolio & Pitch Review"
      },
      {
        "icon": "TfiCup",
        "text": "Freelance Certification"
      },
      {
        "icon": "MdWorkOutline",
        "text": "Freelancer Toolkit (Templates, Contracts)"
      }
    ],
    "softwareYoullLearn": [
      "Adobe Premiere Pro",
      "Adobe After Effects",
      "DaVinci Resolve",
      "Final Cut Pro",
      "Final Cut Pro"
    ],
    "jobPositions": [
      "Video Editor",
      "Post-Production Specialist",
      "Color Grading Specialist",
      "Motion Graphics Designer",
      "Visual Effects (VFX) Artist",
      "Multimedia Content Creator"
    ]
  }
]
